

以下为员工管理系统带调试信息的打印记录：
	管理员登陆：
		客户端的打印信息
		服务器端的打印信息
		
	普通员工登陆：
		客户端的打印信息
		服务器端的打印信息
		

@@@@@@@@@@@@@@@@@@@@@@管理员登陆--客户端的测试记录：@@@@@@@@@@@@@@@@@@@@@@

linux@ubuntu:/mnt/hgfs/KernelSource/staff_manage_select/stage4-user$ ./client
sockfd :3.
*************************************************************
********  1：管理员模式    2：普通用户模式    3：退出********
*************************************************************
请输入您的选择（数字）>>1
------------admin_or_user_login-----------489.
请输入用户名：admin
请输入密码（6位）admin
msg->recvmsg :OK
亲爱的管理员，欢迎您登陆员工管理系统！


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>1
------------do_admin_query-----------35.
*************************************************************
******* 1：按人名查找  	2：查找所有 	3：退出	 *******
*************************************************************
请输入您的选择（数字）>>1
请输入您要查找的用户名：xiaohui
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1004,    1,    xiaohui,    1,    31,    1888x,    henan,    gagagaga,    9012.10.11,    1,    1.0;.
*************************************************************
******* 1：按人名查找  	2：查找所有 	3：退出	 *******
*************************************************************
请输入您的选择（数字）>>2
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1001,    0,    admin,    admin,    18,    110,    华清远见创客学院,    嵌入式物联网方向讲师,    xxx,    5,    1.0;.
======================================================================================
1003,    1,    fengjunhui,    1,    30,    18888888888,    henan,    gaga,    2015.10.23,    1,    10.0;.
======================================================================================
1002,    1,    lisi,    1,    20,    119,    华清远见创客学院=北京,    ooo,    2019.11.11,    1,    50.0;.
======================================================================================
1004,    1,    xiaohui,    1,    31,    1888x,    henan,    gagagaga,    9012.10.11,    1,    1.0;.
*************************************************************
******* 1：按人名查找  	2：查找所有 	3：退出	 *******
*************************************************************
请输入您的选择（数字）>>3


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>2
------------do_admin_modification-----------100.
请输入您要修改只认的工号：1002
*******************请输入要修改的选项********************
******	1：姓名	  2：年龄	3：家庭住址   4：电话  ******
******	5：职位	   6：工资  7：入职年月   8：评级  ******
******	9：密码	 10：退出				  *******
*************************************************************
请输入您的选择（数字）>>2
请输入年龄：30 
数据库修改成功!修改结束.


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>1
------------do_admin_query-----------35.
*************************************************************
******* 1：按人名查找  	2：查找所有 	3：退出	 *******
*************************************************************
请输入您的选择（数字）>>1
请输入您要查找的用户名：lisi
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1002,    1,    lisi,    1,    30,    119,    华清远见创客学院=北京,    ooo,    2019.11.11,    1,    50.0;.


*************************************************************
******* 1：按人名查找  	2：查找所有 	3：退出	 *******
*************************************************************
请输入您的选择（数字）>>3
*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>2
------------do_admin_modification-----------100.
请输入您要修改只认的工号：1002
*******************请输入要修改的选项********************
******	1：姓名	  2：年龄	3：家庭住址   4：电话  ******
******	5：职位	   6：工资  7：入职年月   8：评级  ******
******	9：密码	 10：退出				  *******
*************************************************************
请输入您的选择（数字）>>4
请输入电话：1888xxxxxxx
数据库修改成功!修改结束.


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>3
------------do_admin_adduser-----------186.
***************热烈欢迎新员工***************.
请输入工号：1005 
您输入的工号是：1005
工号信息一旦录入无法更改，请确认您所输入的是否正确！(Y/N)y
请输入用户名：zhangsan
请输入用户密码：1
请输入年龄：29
请输入电话：15600700xxx
请输入家庭住址：中国北京
请输入职位：coder  
请收入入职日期(格式：0000.00.00)：2019.3.25
请输入评级(1~5,5为最高，新员工为 1)：1
请输入工资：100
是否为管理员：(Y/N)n
msg->info.usertype:1
数据库修改成功!是否继续添加员工:(Y/N)n


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>4
------------do_admin_deluser-----------277.
请输入要删除的用户工号：1002
请输入要删除的用户名：lisi
数据库修改成功!删除工号为：1002 的用户.


*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>5
------------do_admin_history-----------308.
msg->recvmsg: 2019-3-24 21:54:32---admin---管理员admin添加了xiaohui用户.
msg->recvmsg: 2019-3-25 12:10:15---lisi---lisi修改工号为1002的电话为119.
msg->recvmsg: 2019-3-25 12:21:14---admin---.
msg->recvmsg: 2019-3-25 12:21:51---admin---admin修改工号为1002的年龄为30.
msg->recvmsg: 2019-3-25 12:22:5---admin---.
msg->recvmsg: 2019-3-25 12:22:37---admin---admin修改工号为1002的电话为1888xxxxxxx.
msg->recvmsg: 2019-3-25 12:24:6---admin---管理员admin添加了zhangsan用户.
msg->recvmsg: 2019-3-25 12:24:34---admin---管理员admin删除了lisi用户.
admin查询历史记录结束！
*************************************************************
* 1：查询  2：修改 3：添加用户  4：删除用户  5：查询历史记录*
* 6：退出													*
*************************************************************
请输入您的选择（数字）>>6




@@@@@@@@@@@@@@@@@@@@@@管理员登陆---服务器端的打印信息@@@@@@@@@@@@@@@@@@@@@@

linux@ubuntu:/mnt/hgfs/KernelSource/staff_manage_select/stage4-user$ ./server
the database open success.
table usrinfo already exists.
table historyinfo already exists.
sockfd :4.
ip : 192.168.1.200.
msg.type :0x10000000.

------------process_client_request-----------445.
------------process_user_or_admin_login_request-----------69.
usrtype: 0-----usrname: admin---passwd: admin.
msg.type :0x10000008.

------------process_client_request-----------445.
------------process_admin_query_request-----------324.
searching.....
ncolumn :11	nrow :1.
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
=============================================================
1004    1     xiaohui     1     31     1888x     henan     gagagaga     9012.10.11     1     1.0.
=============================================================
sqlite3_get_table successfully.
msg.type :0x10000008.

------------process_client_request-----------445.
------------process_admin_query_request-----------324.
searching.....
ncolumn :11	nrow :4.
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
=============================================================
1001    0     admin     admin     18     110     华清远见创客学院     嵌入式物联网方向讲师     xxx     5     1.0.
=============================================================
1003    1     fengjunhui     1     30     18888888888     henan     gaga     2015.10.23     1     10.0.
=============================================================
1002    1     lisi     1     20     119     华清远见创客学院=北京     ooo     2019.11.11     1     50.0.
=============================================================
1004    1     xiaohui     1     31     1888x     henan     gagagaga     9012.10.11     1     1.0.
=============================================================
sqlite3_get_table successfully.
msg.type :0x10000001.


------------process_client_request-----------445.
------------process_admin_modify_request-----------190.
the database is updated successfully.
insert historyinfo success.
------.
msg.type :0x10000001.


------------process_client_request-----------445.
------------process_admin_modify_request-----------190.
the database is updated successfully.
insert historyinfo success.
------admin修改工号为1002的年龄为30.
msg.type :0x10000008.


------------process_client_request-----------445.
------------process_admin_query_request-----------324.
searching.....
ncolumn :11	nrow :1.
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
=============================================================
1002    1     lisi     1     30     119     华清远见创客学院=北京     ooo     2019.11.11     1     50.0.
=============================================================
sqlite3_get_table successfully.
msg.type :0x10000001.


------------process_client_request-----------445.
------------process_admin_modify_request-----------190.
the database is updated successfully.
insert historyinfo success.
------.
msg.type :0x10000001.


------------process_client_request-----------445.
------------process_admin_modify_request-----------190.
the database is updated successfully.
insert historyinfo success.
------admin修改工号为1002的电话为1888xxxxxxx.
msg.type :0x10000002.


------------process_client_request-----------445.
------------process_admin_adduser_request-----------259.
1005	 1	 zhangsan	 1	 29
 15600700xxx	 中国北京	 coder	 2019.3.25	 1	 100.000000.
zhangsan register success.
insert historyinfo success.
msg.type :0x10000004.


------------process_client_request-----------445.
------------process_admin_deluser_request-----------295.
msg->info.no :1002	 msg->info.name: lisi.
lisi deluser lisi success.
insert historyinfo success.
msg.type :0x10000010.


------------process_client_request-----------445.
------------process_admin_history_request-----------415.
time       name       words      
2019-3-24 21:54:32-admin-管理员admin添加了xiaohui用户
2019-3-25 12:10:15-lisi-lisi修改工号为1002的电话为119
2019-3-25 12:21:14-admin-
2019-3-25 12:21:51-admin-admin修改工号为1002的年龄为30
2019-3-25 12:22:5-admin-
2019-3-25 12:22:37-admin-admin修改工号为1002的电话为1888xxxxxxx
2019-3-25 12:24:6-admin-管理员admin添加了zhangsan用户
2019-3-25 12:24:34-admin-管理员admin删除了lisi用户
query history record done.
msg.type :0x11111111.


------------process_client_request-----------445.
------------process_client_quit_request-----------438.
msg.type :0x11111111.
peer shutdown.








@@@@@@@@@@@@@@@@@@@@@@普通用户登陆 客户端的打印信息：@@@@@@@@@@@@@@@@@@@@@@

linux@ubuntu:/mnt/hgfs/KernelSource/staff_manage_select/stage4-user$ ./client
sockfd :3.
*************************************************************
********  1：管理员模式    2：普通用户模式    3：退出********
*************************************************************
请输入您的选择（数字）>>2
------------admin_or_user_login-----------489.
请输入用户名：xiaohui
请输入密码（6位）1
msg->recvmsg :OK
亲爱的用户，欢迎您登陆员工管理系统！


------------user_menu-----------451.
*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>1
------------do_user_query-----------380.
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1004,    1,    xiaohui,    1,    31,    1888x,    henan,    gagagaga,    9012.10.11,    1,    1.0;.


*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>2
------------do_user_modification-----------400.
请输入您要修改只认的工号：1004
***********请输入要修改的选项(其他信息亲请联系管理员)*********
***********	1：家庭住址   2：电话  3：密码  4：退出***********
**************************************************************
请输入您的选择（数字）>>2
请输入电话：15600700xxx
数据库修改成功!
修改结束.
*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>1
------------do_user_query-----------380.
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1004,    1,    xiaohui,    1,    31,    15600700xxx,    henan,    gagagaga,    9012.10.11,    1,    1.0;.



*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>2
------------do_user_modification-----------400.
请输入您要修改只认的工号：1004
***********请输入要修改的选项(其他信息亲请联系管理员)*********
***********	1：家庭住址   2：电话  3：密码  4：退出***********
**************************************************************
请输入您的选择（数字）>>3
请输入新密码：(6位数字)111111
数据库修改成功!
修改结束.
*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>1
------------do_user_query-----------380.
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1004,    1,    xiaohui,    111111,    31,    15600700xxx,    henan,    gagagaga,    9012.10.11,    1,    1.0;.



*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>2
------------do_user_modification-----------400.
请输入您要修改只认的工号：1004
***********请输入要修改的选项(其他信息亲请联系管理员)*********
***********	1：家庭住址   2：电话  3：密码  4：退出***********
**************************************************************
请输入您的选择（数字）>>1
请输入家庭住址：太阳系中和月球为邻居的绿色的地球
数据库修改成功!
修改结束.
*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>1
------------do_user_query-----------380.
工号	用户类型	 姓名	密码	年龄	电话	地址	职位	入职年月	等级	 工资
======================================================================================
1004,    1,    xiaohui,    111111,    31,    15600700xxx,    太阳系中和月球为邻居的绿色的地球,    gagagaga,    9012.10.11,    1,    1.0;.



*************************************************************
*************  1：查询  	2：修改		3：退出	 *************
*************************************************************
请输入您的选择（数字）>>3



@@@@@@@@@@@@@@@@@@@@@@普通用户登陆 客户端的打印信息：@@@@@@@@@@@@@@@@@@@@@@

ip : 192.168.1.200.
msg.type :0.
------------process_client_request-----------445.
------------process_user_or_admin_login_request-----------69.
usrtype: 0x1-----usrname: xiaohui---passwd: 1.
msg.type :0x2.
------------process_client_request-----------445.
------------process_user_query_request-----------145.
searching.....
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
======================================================================================
1004    1     xiaohui     1     31     1888x     henan     gagagaga     9012.10.11     1     1.0.
======================================================================================
sqlite3_get_table successfully.

msg.type :0x1.
------------process_client_request-----------445.
------------process_user_modify_request-----------99.
msgtype :0x1--usrtype: 0x1--usrname: xiaohui-passwd: 1.
msg->info.no :1004	 msg->info.addr �	 msg->info.phone: 15600700xxx.
the database is updated successfully.
insert historyinfo success.
------xiaohui修改工号为1004的电话为15600700xxx.


msg.type :0x2.
------------process_client_request-----------445.
------------process_user_query_request-----------145.
searching.....
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
======================================================================================
1004    1     xiaohui     1     31     15600700xxx     henan     gagagaga     9012.10.11     1     1.0.
======================================================================================
sqlite3_get_table successfully.


msg.type :0x1.
------------process_client_request-----------445.
------------process_user_modify_request-----------99.
msgtype :0x1--usrtype: 0x1--usrname: xiaohui-passwd: 111111.
msg->info.no :1004	 msg->info.addr �	 msg->info.phone: 15600700xxx.
the database is updated successfully.
insert historyinfo success.
------xiaohui修改工号为1004的密码为111111.


msg.type :0x2.
------------process_client_request-----------445.
------------process_user_query_request-----------145.
searching.....
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
======================================================================================
1004    1     xiaohui     111111     31     15600700xxx     henan     gagagaga     9012.10.11     1     1.0.
======================================================================================
sqlite3_get_table successfully.

msg.type :0x1.
------------process_client_request-----------445.
------------process_user_modify_request-----------99.
msgtype :0x1--usrtype: 0x1--usrname: xiaohui-passwd: 111111.
msg->info.no :1004	 msg->info.addr 太阳系中和月球为邻居的绿色的地球	 msg->info.phone: 15600700xxx.
the database is updated successfully.
insert historyinfo success.
------xiaohui修改工号为1004的家庭住址为太阳系中和月球为邻居的绿色的地球.


msg.type :0x2.
------------process_client_request-----------445.
------------process_user_query_request-----------145.
searching.....
staffno  usertype name     passwd   age      phone    addr     work     date     level    salary   
======================================================================================
1004    1     xiaohui     111111     31     15600700xxx     太阳系中和月球为邻居的绿色的地球     gagagaga     9012.10.11     1     1.0.
======================================================================================
sqlite3_get_table successfully.
msg.type :0x11111111.
------------process_client_request-----------445.
------------process_client_quit_request-----------438.
msg.type :0x11111111.
peer shutdown.










































